In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
%matplotlib inline

In [2]:
train = pd.read_csv("C:\\Users\\dilip-k\\MachineLearning_Models\\train_gender_submission.csv")
test = pd.read_csv("C:\\Users\\dilip-k\\MachineLearning_Models\\test_gender_submission.csv")

In [3]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [5]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [7]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [8]:
test.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

In [9]:
train.shape

(891, 12)

In [10]:
test.shape

(418, 11)

In [11]:
#drop the passengerid column as it is not relevant
train.drop(['PassengerId'],axis = 1, inplace = True)

In [12]:
test.drop(['PassengerId'],axis = 1, inplace = True)

In [13]:
# extract the title from Name column, name it as title and drop Name column
train['Name'][0]

'Braund, Mr. Owen Harris'

In [14]:
title_col = [i.split(",")[1].split(".")[0].strip()
            for i in train['Name']]
train['Title'] = pd.Series(title_col)
train['Title'].head()

0      Mr
1     Mrs
2    Miss
3     Mrs
4      Mr
Name: Title, dtype: object

In [15]:
title_col = [i.split(",")[1].split(".")[0].strip()
            for i in test['Name']]
test['Title'] = pd.Series(title_col)
test['Title'].head()

0     Mr
1    Mrs
2     Mr
3     Mr
4    Mrs
Name: Title, dtype: object

In [16]:
train.drop(["Name"],axis = 1, inplace = True)

In [17]:
test.drop(["Name"],axis = 1, inplace = True)

In [18]:
train.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr
1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs
2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss
3,1,1,female,35.0,1,0,113803,53.1000,C123,S,Mrs
4,0,3,male,35.0,0,0,373450,8.0500,NaN,S,Mr

In [19]:
train.drop(["Ticket"],axis = 1, inplace = True)

In [20]:
test.drop(["Ticket"],axis = 1, inplace = True)

In [21]:
train.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Cabin Embarked Title
0         0       3    male  22.0      1      0   7.2500   NaN        S    Mr
1         1       1  female  38.0      1      0  71.2833   C85        C   Mrs
2         1       3  female  26.0      0      0   7.9250   NaN        S  Miss
3         1       1  female  35.0      1      0  53.1000  C123        S   Mrs
4         0       3    male  35.0      0      0   8.0500   NaN        S    Mr

In [22]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       714 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Fare      891 non-null    float64
 7   Cabin     204 non-null    object
 8   Embarked  889 non-null    object
 9   Title     891 non-null    object
dtypes: float64(2), int64(4), object(4)
memory usage: 69.7+ KB

In [23]:
train[train.isnull().any(axis=1)]

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Title
0,0,3,male,22.0,1,0,7.2500,NaN,S,Mr
2,1,3,female,26.0,0,0,7.9250,NaN,S,Miss
4,0,3,male,35.0,0,0,8.0500,NaN,S,Mr
5,0,3,male,NaN,0,0,8.4583,NaN,Q,Mr
7,0,3,male,2.0,3,1,21.0750,NaN,S,Master
...,...,...,...,...,...,...,...,...,...,...
884,0,3,male,25.0,0,0,7.0500,NaN,S,Mr
885,0,3,female,39.0,0,5,29.1250,NaN,Q,Mrs
886,0,2,male,27.0,0,0,13.0000,NaN,S,Rev
888,0,3,female,NaN,1,2,23.4500,NaN,S,Miss
890,0,3,male,32.0,0,0,7.7500,NaN,Q,Mr

In [24]:
train.isnull().values.any()

True

In [25]:
#find categorical values
categorical = [var for var in train.columns if train.dtypes[var] == 'O']
print('There are {} categorical variables\n'.format(len(categorical)))
print('The categorical variables are :', categorical)

There are 4 categorical variables

The categorical variables are : ['Sex', 'Cabin', 'Embarked', 'Title']

In [26]:
for var in categorical:
    print(train[var].value_counts())

male      577
female    314
Name: Sex, dtype: int64
G6             4
B96 B98        4
C23 C25 C27    4
D              3
E101           3
              ..
E40            1
T              1
B78            1
E68            1
E63            1
Name: Cabin, Length: 147, dtype: int64
S    644
C    168
Q     77
Name: Embarked, dtype: int64
Mr              517
Miss            182
Mrs             125
Master           40
Dr                7
Rev               6
Mlle              2
Col               2
Major             2
Capt              1
Mme               1
Sir               1
Lady              1
the Countess      1
Jonkheer          1
Don               1
Ms                1
Name: Title, dtype: int64

In [27]:
#find missing values
train['Pclass'].isnull().values.any()

False

In [28]:
train['Sex'].isnull().values.any()

False

In [29]:
train['Age'].isnull().values.any()

True

In [30]:
train['Sex'].isnull().values.any()

False

In [31]:
train['SibSp'].isnull().values.any()

False

In [32]:
train['Parch'].isnull().values.any()

False

In [33]:
train['Fare'].isnull().values.any()

False

In [34]:
train['Cabin'].isnull().values.any()

True

In [35]:
train['Embarked'].isnull().values.any()

True

In [36]:
train['Title'].isnull().values.any()

False

In [37]:
#replace NAN values in Cabin column
for df in [train,test]:
    df['Cabin'].fillna(train['Cabin'].mode()[0],inplace = True)

In [38]:
for df in [train,test]:
    df['Embarked'].fillna(train['Embarked'].mode()[0],inplace = True)

In [39]:
numerical = [var for var in train.columns if train.dtypes[var] != 'O']
numerical

['Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']

In [40]:
for col in numerical:
    print(train[col].value_counts())

0    549
1    342
Name: Survived, dtype: int64
3    491
1    216
2    184
Name: Pclass, dtype: int64
24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
         ..
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: Age, Length: 88, dtype: int64
0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64
0    678
1    118
2     80
5      5
3      5
4      4
6      1
Name: Parch, dtype: int64
8.0500     43
13.0000    42
7.8958     38
7.7500     34
26.0000    31
           ..
8.4583      1
9.8375      1
8.3625      1
14.1083     1
17.4000     1
Name: Fare, Length: 248, dtype: int64

In [41]:
for df in [train,test]:
    df['Age'].fillna(train['Age'].mean(),inplace = True)

In [42]:
train.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Title
0,0,3,male,22.0,1,0,7.2500,B96 B98,S,Mr
1,1,1,female,38.0,1,0,71.2833,C85,C,Mrs
2,1,3,female,26.0,0,0,7.9250,B96 B98,S,Miss
3,1,1,female,35.0,1,0,53.1000,C123,S,Mrs
4,0,3,male,35.0,0,0,8.0500,B96 B98,S,Mr

In [43]:
train.isnull().values.any()

False

In [44]:
test.isnull().values.any()

True

In [45]:
test.head()

   Pclass     Sex   Age  SibSp  Parch     Fare    Cabin Embarked Title
0       3    male  34.5      0      0   7.8292  B96 B98        Q    Mr
1       3  female  47.0      1      0   7.0000  B96 B98        S   Mrs
2       2    male  62.0      0      0   9.6875  B96 B98        Q    Mr
3       3    male  27.0      0      0   8.6625  B96 B98        S    Mr
4       3  female  22.0      1      1  12.2875  B96 B98        S   Mrs

In [46]:
#test['Pclass'].isnull().values.any()
#test['Sex'].isnull().values.any()
#test['Age'].isnull().values.any()
#test['SibSp'].isnull().values.any()
#test['Parch'].isnull().values.any()
test['Fare'].isnull().values.any()

True

In [47]:
test['Fare'].fillna(test['Fare'].median(),inplace=True)

In [48]:
test.isnull().values.any()

False

In [49]:
#get-dummies for categorical variables
train = pd.concat([train[numerical],pd.get_dummies(train.Sex),
                  pd.get_dummies(train.Cabin),
                  pd.get_dummies(train.Embarked),
                  pd.get_dummies(train.Title)], axis = 1)

In [50]:
numerical_test = [var for var in test.columns if test.dtypes[var] != 'O']

In [51]:
test = pd.concat([test[numerical_test],pd.get_dummies(test.Sex),
                  pd.get_dummies(test.Cabin),
                  pd.get_dummies(test.Embarked),
                  pd.get_dummies(test.Title)], axis = 1)

In [52]:
train.shape

(891, 175)

In [53]:
test.shape

(418, 96)

In [54]:
from sklearn.ensemble import RandomForestClassifier
rf = RandomForestClassifier(criterion = 'gini',
                            n_estimators = 700,
                            min_samples_split = 10,
                            min_samples_leaf = 1,
                            max_features = 'auto',
                            oob_score = True,                            
                            random_state=1,
                           n_jobs = -1)
rf.fit(train[:,1:],train[:,0])
print("%.4f" % rf.oob_score_)

TypeError: '(slice(None, None, None), slice(1, None, None))' is an invalid key